import random


def lock_number():
    """функция, случайным образом генерирующая любое число в диапазоне от 3 до 20"""
    list = [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
    random_num = random.choice(list)
    return random_num


first = lock_number()
print(first)

a = b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]


def key_number():
    """функция, составляющая число из всевозможных делителей ()"""
    global first
    result = ' '  # пустой список нужных комбинаций чисел

    for i in (a):  # перебираем список на варианты первого слагаемого
        for j in (b):  # и второго слагаемого
            if first % (i + j) == 0:  # условие деления рандомного числа
                result += f'{i}{j}'

    print(f'{first} - {result}')
# return result  # возвращаем результат


key_number()